nxp-mcuxpresso/mcuxsdk-examples/_boards/mcxw23evk/common/pin_mux/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MCXW236B
package_id: MCXW236BIHNAR
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: '7', pin_signal: PIO0_19/FC2_TXD_SCL_MISO/SCT_GPI0/PLU_OUT7/SEC_PIO0_19/CTIMER4_MAT3/CTIMER_INP19, label: LED_B, identifier: LED_B}
- {pin_num: '31', pin_signal: PIO0_0/FC0_CTS_SDA_SSEL0/FC1_RTS_SCL_SSEL1/SEC_PIO0_0/CTIMER0_MAT0/CTIMER_INP0, label: RGB_G, identifier: RGB_G}
- {pin_num: '1', pin_signal: PIO0_1/FC0_RTS_SCL_SSEL1/FC2_SCK/PLU_CLKIN/SEC_PIO0_1/CTIMER0_MAT1/CTIMER_INP1, label: RGB_R, identifier: RGB_R}
- {pin_num: '4', pin_signal: PIO0_4/FC0_SCK/SCT_OUT7/SEC_PIO0_4/CTIMER1_MAT0/CTIMER_INP4, label: RGB_B, identifier: RGB_B}
- {pin_num: '8', pin_signal: PIO0_18/FC2_RXD_SDA_MOSI/SCT_GPI1/CLKOUT/PLU_OUT6/SEC_PIO0_18/CTIMER4_MAT2/CTIMER_INP18, label: SW2, identifier: SW2}
- {pin_num: '30', pin_signal: PIO0_20/SEC_PIO0_20/CTIMER_INP20, label: SW3, identifier: SW3}
- {pin_num: '14', pin_signal: PIO0_21/WAKEUP/SEC_PIO0_21/CTIMER_INP21, label: SW5, identifier: SW5}
- {pin_num: '3', pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3, label: DEBUG_UART_TX, identifier: DEBUG_UART_TX}
- {pin_num: '2', pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2, label: DEBUG_UART_RX, identifier: DEBUG_UART_RX}
- {pin_num: '5', pin_signal: PIO0_14/FC1_TXD_SCL_MISO/FC2_RTS_SCL_SSEL1/SCT_OUT1/FREQME_GPIO_14/UTICK_CAP3/PLU_OUT2/SEC_PIO0_14/CTIMER3_MAT2/CTIMER_INP14, label: I2C_SCL,
  identifier: I2C_SCL}
- {pin_num: '6', pin_signal: PIO0_13/FC1_RXD_SDA_MOSI/FC2_CTS_SDA_SSEL0/SCT_OUT2/UTICK_CAP2/PLU_OUT1/SEC_PIO0_13/CTIMER3_MAT1/CTIMER_INP13, label: I2C_SDA, identifier: I2C_SDA}
- {pin_num: '35', pin_signal: PIO0_15/SWO/FC1_CTS_SDA_SSEL0/SCT_OUT0/PLU_OUT3/SEC_PIO0_15/ANT_SWITCH_0/CTIMER3_MAT3/CTIMER_INP15, label: ACCL_INT1, identifier: INT1;ACCL_INT1}
- {pin_num: '32', pin_signal: PIO0_16/FC1_SCK/SCT_GPI3/PLU_OUT4/SEC_PIO0_16/ANT_SWITCH_1/CTIMER4_MAT0/CTIMER_INP16, label: INT2, identifier: ACCL_INT2;INT2}
- {pin_num: '33', pin_signal: PIO0_12/SWDIO/FC1_RTS_SCL_SSEL1/SCT_OUT3/FREQME_GPIO_12/UTICK_CAP1/PLU_OUT0/SEC_PIO0_12/CTIMER3_MAT0/CTIMER_INP12, label: SWDIO, identifier: SWDIO}
- {pin_num: '34', pin_signal: PIO0_11/SWCLK/FC1_CTS_SDA_SSEL0/SCT_GPI4/FREQME_GPIO_11/UTICK_CAP0/PLU_CLKIN/SEC_PIO0_11/CTIMER2_MAT3/CTIMER_INP11, label: SWCLK, identifier: SWCLK}
- {pin_num: '28', pin_signal: PIO0_17/SWO/FC0_CTS_SDA_SSEL0/SCT_GPI2/PLU_OUT5/SEC_PIO0_17/ANT_SWITCH_2/CTIMER4_MAT1/CTIMER_INP17, label: SWO, identifier: SWO}
- {pin_num: '38', pin_signal: PIO0_7/FC2_TXD_SCL_MISO/SCT_OUT4/UTICK_CAP2/PLU_IN2/SEC_PIO0_7/SPIFI_IO1/CTIMER1_MAT3/CTIMER_INP7/ANT_SWITCH_1, label: FLASH_SOUT, identifier: FLASH_SOUT}
- {pin_num: '10', pin_signal: PIO0_6/FC2_RXD_SDA_MOSI/SCT_OUT5/UTICK_CAP1/PLU_IN1/SEC_PIO0_6/SPIFI_IO0/CTIMER1_MAT2/CTIMER_INP6/ANT_SWITCH_0, label: FLASH_SIN, identifier: FLASH_SIN}
- {pin_num: '37', pin_signal: PIO0_5/FC2_CTS_SDA_SSEL0/SCT_OUT6/UTICK_CAP0/PLU_IN0/SEC_PIO0_5/SPIFI_CSN/CTIMER1_MAT1/CTIMER_INP5, label: FLASH_CS, identifier: FLASH_CS}
- {pin_num: '39', pin_signal: PIO0_8/FC2_RTS_SCL_SSEL1/SCT_GPI7/UTICK_CAP3/PLU_IN3/SEC_PIO0_8/SPIFI_IO2/CTIMER2_MAT0/CTIMER_INP8/ANT_SWITCH_2, label: FLASH_WP, identifier: FLASH_WP}
- {pin_num: '11', pin_signal: PIO0_10/FC2_SCK/SCT_GPI5/PLU_IN5/SEC_PIO0_10/SPIFI_CLK/CTIMER2_MAT2/CTIMER_INP10, label: FLASH_SCK, identifier: FLASH_SCK}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '2', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI, pin_signal: PIO0_2/FC0_RXD_SDA_MOSI/SCT_OUT9/SEC_PIO0_2/CTIMER0_MAT2/CTIMER_INP2, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '3', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO, pin_signal: PIO0_3/FC0_TXD_SCL_MISO/SCT_OUT8/FREQME_GPIO_3/SEC_PIO0_3/CTIMER0_MAT3/CTIMER_INP3, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t port0_pin2_config = (/* Pin is configured as FC0_RXD_SDA_MOSI */
                                        IOCON_PIO_FUNC1 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN2 (coords: 2) is configured as FC0_RXD_SDA_MOSI */
    IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

