nxp-mcuxpresso/mcuxsdk-examples/_boards/mcxw23evk/common/pin_mux/pin_mux.c
    const uint32_t port0_pin3_config = (/* Pin is configured as FC0_TXD_SCL_MISO */
                                        IOCON_PIO_FUNC1 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN3 (coords: 3) is configured as FC0_TXD_SCL_MISO */
    IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '31', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/FC0_CTS_SDA_SSEL0/FC1_RTS_SCL_SSEL1/SEC_PIO0_0/CTIMER0_MAT0/CTIMER_INP0, direction: OUTPUT,
    gpio_init_state: 'false', mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '1', peripheral: GPIO, signal: 'PIO0, 1', pin_signal: PIO0_1/FC0_RTS_SCL_SSEL1/FC2_SCK/PLU_CLKIN/SEC_PIO0_1/CTIMER0_MAT1/CTIMER_INP1, direction: OUTPUT,
    gpio_init_state: 'false', mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 4', pin_signal: PIO0_4/FC0_SCK/SCT_OUT7/SEC_PIO0_4/CTIMER1_MAT0/CTIMER_INP4, direction: OUTPUT, gpio_init_state: 'false',
    mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '7', peripheral: GPIO, signal: 'PIO0, 19', pin_signal: PIO0_19/FC2_TXD_SCL_MISO/SCT_GPI0/PLU_OUT7/SEC_PIO0_19/CTIMER4_MAT3/CTIMER_INP19, direction: OUTPUT,
    gpio_init_state: 'false', mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitLEDsPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t RGB_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 31)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_RGB_G_GPIO, BOARD_INITLEDSPINS_RGB_G_PORT, BOARD_INITLEDSPINS_RGB_G_PIN, &RGB_G_config);

    gpio_pin_config_t RGB_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 1)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_RGB_R_GPIO, BOARD_INITLEDSPINS_RGB_R_PORT, BOARD_INITLEDSPINS_RGB_R_PIN, &RGB_R_config);

    gpio_pin_config_t RGB_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin 4)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_RGB_B_GPIO, BOARD_INITLEDSPINS_RGB_B_PORT, BOARD_INITLEDSPINS_RGB_B_PIN, &RGB_B_config);

    gpio_pin_config_t LED_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 7)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED_B_GPIO, BOARD_INITLEDSPINS_LED_B_PORT, BOARD_INITLEDSPINS_LED_B_PIN, &LED_B_config);

    const uint32_t RGB_G = (/* Pin is configured as PIO0_0 */
                            IOCON_PIO_FUNC0 |
                            /* Selects pull-up function */
                            IOCON_PIO_MODE_PULLUP |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN0 (coords: 31) is configured as PIO0_0 */
    IOCON_PinMuxSet(IOCON, BOARD_INITLEDSPINS_RGB_G_PORT, BOARD_INITLEDSPINS_RGB_G_PIN, RGB_G);

    const uint32_t RGB_R = (/* Pin is configured as PIO0_1 */
                            IOCON_PIO_FUNC0 |
                            /* Selects pull-up function */
                            IOCON_PIO_MODE_PULLUP |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN1 (coords: 1) is configured as PIO0_1 */
    IOCON_PinMuxSet(IOCON, BOARD_INITLEDSPINS_RGB_R_PORT, BOARD_INITLEDSPINS_RGB_R_PIN, RGB_R);

    const uint32_t LED_B = (/* Pin is configured as PIO0_19 */
                            IOCON_PIO_FUNC0 |
                            /* Selects pull-up function */
                            IOCON_PIO_MODE_PULLUP |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN19 (coords: 7) is configured as PIO0_19 */
    IOCON_PinMuxSet(IOCON, BOARD_INITLEDSPINS_LED_B_PORT, BOARD_INITLEDSPINS_LED_B_PIN, LED_B);

    const uint32_t RGB_B = (/* Pin is configured as PIO0_4 */
                            IOCON_PIO_FUNC0 |
                            /* Selects pull-up function */
                            IOCON_PIO_MODE_PULLUP |
                            /* Standard mode, output slew rate control is enabled */
                            IOCON_PIO_SLEW_STANDARD |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN4 (coords: 4) is configured as PIO0_4 */
    IOCON_PinMuxSet(IOCON, BOARD_INITLEDSPINS_RGB_B_PORT, BOARD_INITLEDSPINS_RGB_B_PIN, RGB_B);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '8', peripheral: GPIO, signal: 'PIO0, 18', pin_signal: PIO0_18/FC2_RXD_SDA_MOSI/SCT_GPI1/CLKOUT/PLU_OUT6/SEC_PIO0_18/CTIMER4_MAT2/CTIMER_INP18, direction: INPUT,
    mode: pullUp, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '30', peripheral: GPIO, signal: 'PIO0, 20', pin_signal: PIO0_20/SEC_PIO0_20/CTIMER_INP20, direction: INPUT, mode: pullUp, slew_rate: standard, invert: disabled,
    open_drain: disabled}
  - {pin_num: '14', peripheral: GPIO, signal: 'PIO0, 21', pin_signal: PIO0_21/WAKEUP/SEC_PIO0_21/CTIMER_INP21, direction: INPUT, mode: pullUp, slew_rate: standard,
    invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

